"use client";
import Image from "next/image";
import SelectTopicsOptionArrow from "../../../public/Assets/Accordian/SelectTopicsOptionArrow.svg";
import { useState } from "react";
import "./Accordian.css";

function Accordian() {
  const [isOpen, setIsOpen] = useState(false);
  return (
    <div className="relative overflow-hidden rounded-lg">
      <div className="relative z-[1]" onClick={() => setIsOpen(!isOpen)}>
        <div className="w-full rounded-lg bg-[#F5F5F5] text-[#757575] text-sm md:text-base lg:text-xl font-normal leading-[23.87px] p-5 flex cursor-pointer">
          Accordian Title
        </div>

        <div
          className={`absolute top-0 right-3 flex justify-center items-center h-full`}
        >
          <Image
            src={SelectTopicsOptionArrow}
            className="w-[10.47px] h-[6.7px]"
            alt="SelectTopicsOptionArrow"
          />
        </div>
      </div>

      <div
        className={`accordian-transition bg-blue-300 ${
          isOpen ? "visible pt-4" : "invisible translate-y-[-180px]"
        }`}
      >
        কেয়ার- বক্স লিমিটেড এমন একটি প্রতিষ্ঠান যেখানে গ্রাহকদের চাহিদা
        অনুযায়ী মানসম্মত পণ্য ক্রয় করে পাশাপাশি সাশ্রয়ী মূল্যে পণ্য বিক্রয়
        বা সেবা প্রদান করে থাকে। কেয়ার-বক্স ২০২১ সালের জুন মাসে ব্যবসা শুরু করে
        এবং আমাদের ওয়েবসাইট ২০২১ সালের অক্টোবরে অনলাইনে প্রকাশিত হয়। গ্রাহকরা
        বিনা মূল্যে ডাক্তারি সেবা সহ প্রসাধনী পণ্য, প্রয়োজনীয় ঔষুধ এবং নিত্য
        প্রয়োজনীয় বিভিন্ন ধরনের পণ্য সরাসরি বা অনলাইনের মাধ্যমে ক্রয় করতে পারেন।
        আমরা পণ্য সরবরাহে নিয়মিত এবং এক্সপ্রেস পদ্বটিতে ডেলিভারি করে থাকি ।
        নিয়মিত ডেলিভারি বিনামূল্যে, সর্বোচ্চ দুই দিনের মধ্যে পণ্য সরবরাহ করি
        এবং এক্সপ্রেস ডেলিভারি ঢাকার মধ্যে 24 ঘন্টার মধ্যে পণ্য সরবরাহ করি।
        উপরোক্ত, আমাদের একটি সেবা রয়েছে যেখানে গ্রাহকরা আমাদের অভ্যন্তরীণ
        ডাক্তারদের সাথে সরাসরি পরামর্শ নিয়ে চিকিৎসা সেবা নিতে পারেন। আমাদের
        অ্যাপসের মাধ্যমে ভেজাল মুক্ত পণ্য ক্রয় করে নিশিচত করতে পারবেন। আমাদের
        ই-কমার্স ওয়েবসাইটের মাধ্যমে পণ্য কিনতে পারেন। আমরা কোন মেয়াদ উত্তীর্ণ
        পণ্য সরবরাহ করি না। যদি কোন ধরনের পণ্যের মেয়াদের তারিখ অতিক্রম করে,
        আমরা এটি নিষ্পত্তি করতে বদ্ধ পরিকর। আমরা নিশ্চিত করি যে আমাদের সরবরাহ
        কৃত সকল পণ্যসমূহ মান সম্মত ও ব্যবহার যোগ্য । আমাদের সেবার মধ্যে গ্রাহকের
        চাহিদা অনুযায়ী যে কোন পণ্য বা সেবা অনুরোধ করতে পারেন। তথাপি পণ্যের নাম,
        পরিমাণ এবং তার মোবাইল নম্বর দিয়ে পণ্যের ছবিও আপলোড করতে পারবেন । পরক্ষনে
        যত দ্রুত সম্ভব গ্রাহকের ঠিকানায় পৌঁছে দেই । আমরা একটি বিশ্বস্ত এবং
        স্বনামধন্য কোম্পানি যা গ্রাহকদের সাশ্রয়ী মূল্যের মান সম্মত পণ্য ও সেবা
        সরবরাহ করে থাকি । কেয়ার-বক্স ২৫শে জুন ২০২১ এ যাত্রা শুরু করে , এবং আমরা
        গ্রাহকদের সেবা প্রদানের জন্য সর্বদা সচেতন । আমরা গ্রাহকদের সুবিধার্থে
        বিভিন্ন সময়ে বিভিন্ন উপলক্ষে বিনামূল্যে চিকিৎসা সেবা ও পণ্য অফার করে
        থাকি । গ্রাহকদের যতটা সম্ভব স্বাস্থ্যকর এবং মান সম্মত সেবা দিতে চাই।
        প্রশিক্ষিত ফার্মাসিস্ট দ্বারা সর্বোত্তম গ্রাহক সেবা নিশ্চিত করতে
        গ্রাহকদের সু-পরামর্শ প্রদানই হচ্ছে আমদের মূল লক্ষ্য । আমরা সম্মানিত
        গ্রাহকদের জন্য অনলাইন কেনাকাটার সহজ ও সুবিধাজনক করতে
      </div>
    </div>
  );
}

export default Accordian;
